# 1) Даны 2 действительных числа a и b. Получить их сумму, разность произведение

a = float(input('Число: '))
b = float(input('Число: '))
print('Сумма', a + b)
print('Разность', a - b)
print('Произведение', a * b)
