# 4) Даны два действительных числа. Найти среднее арифметическое и среднее геометрическое этих чисел

a = float(input())
b = float(input())
print('среднее арифметическое =', (a + b) / 2)
print('среднее геометрическое =', (a * b) ** (1 / 2))
