# 3) Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности.

a = float(input())
print('площадь боковой поверхности =', a**2, 'Объем куба =', a**3)
